app/views/messages/_list_of_messages.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 1]]
---
<% @user.messages.each do |message| %>