app/controllers/messages_controller.rb

  def create
    @user = User.find(session[:user_id])
    @message = @user.messages.create(message_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "messages" ("created_at", "recipient", "recipient_email", "recipient_phone_number", "send_time", "subject", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)